### pandas assignment 2

create a student record (20 inputs) with the following columns:
ID, Name, Age, Score

do the following using the dataframe created:
1. Display the first 8 rows
2. export the dataframe into a new file called 'Student_copy' without the index
3. use loc to display the details of the student with ID=3,9,11
4. use iloc to display the first 7 rows in the data frame.
5. make the column 'ID' your index

In [25]:
import pandas as pd
Student_record={
    'ID':[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20],
    'Name':['James','Kennedy','Evans','Benson','Edwin','Innocent','Douglas','Ednah','Esther','Clinton',
         'Caroline','Wycliffe','Anne','Andrew','Kevin','Dickson','Slyvia','Geoffrey','Steve','Immaculate'],
    'Age':[18, 19, 20, 21, 22, 23, 24, 25, 18, 19,
            20, 21, 22, 23, 24, 25, 18, 19, 20, 21],
    'Score':[78, 85, 90, 67, 72, 88, 95, 60, 55, 80,
              92, 76, 81, 84, 70, 65, 97, 89, 73, 68]}
idx=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]

In [26]:
idx

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

In [27]:
record=pd.DataFrame(Student_record,index=idx)

In [28]:
record

    ID        Name  Age  Score
1    1       James   18     78
2    2     Kennedy   19     85
3    3       Evans   20     90
4    4      Benson   21     67
5    5       Edwin   22     72
6    6    Innocent   23     88
7    7     Douglas   24     95
8    8       Ednah   25     60
9    9      Esther   18     55
10  10     Clinton   19     80
11  11    Caroline   20     92
12  12    Wycliffe   21     76
13  13        Anne   22     81
14  14      Andrew   23     84
15  15       Kevin   24     70
16  16     Dickson   25     65
17  17      Slyvia   18     97
18  18    Geoffrey   19     89
19  19       Steve   20     73
20  20  Immaculate   21     68

In [30]:
record.to_csv('student_copy.csv',index=False)

In [31]:
record.head(8)

   ID      Name  Age  Score
1   1     James   18     78
2   2   Kennedy   19     85
3   3     Evans   20     90
4   4    Benson   21     67
5   5     Edwin   22     72
6   6  Innocent   23     88
7   7   Douglas   24     95
8   8     Ednah   25     60

In [32]:
record

    ID        Name  Age  Score
1    1       James   18     78
2    2     Kennedy   19     85
3    3       Evans   20     90
4    4      Benson   21     67
5    5       Edwin   22     72
6    6    Innocent   23     88
7    7     Douglas   24     95
8    8       Ednah   25     60
9    9      Esther   18     55
10  10     Clinton   19     80
11  11    Caroline   20     92
12  12    Wycliffe   21     76
13  13        Anne   22     81
14  14      Andrew   23     84
15  15       Kevin   24     70
16  16     Dickson   25     65
17  17      Slyvia   18     97
18  18    Geoffrey   19     89
19  19       Steve   20     73
20  20  Immaculate   21     68

In [34]:
record.loc[3,['Name','Age','Score']]

Name     Evans
Age         20
Score       90
Name: 3, dtype: object

In [35]:
record.loc[9,['Name','Age','Score']]

Name     Esther
Age          18
Score        55
Name: 9, dtype: object

In [36]:
record.loc[11,['Name','Age','Score']]

Name     Caroline
Age            20
Score          92
Name: 11, dtype: object

In [38]:
record.iloc[0:7,0:4]

   ID      Name  Age  Score
1   1     James   18     78
2   2   Kennedy   19     85
3   3     Evans   20     90
4   4    Benson   21     67
5   5     Edwin   22     72
6   6  Innocent   23     88
7   7   Douglas   24     95

In [39]:
record.set_index('ID')

          Name  Age  Score
ID
1        James   18     78
2      Kennedy   19     85
3        Evans   20     90
4       Benson   21     67
5        Edwin   22     72
6     Innocent   23     88
7      Douglas   24     95
8        Ednah   25     60
9       Esther   18     55
10     Clinton   19     80
11    Caroline   20     92
12    Wycliffe   21     76
13        Anne   22     81
14      Andrew   23     84
15       Kevin   24     70
16     Dickson   25     65
17      Slyvia   18     97
18    Geoffrey   19     89
19       Steve   20     73
20  Immaculate   21     68